In [1]:
pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.5.0-py3-none-any.whl.metadata (17 kB)
Collecting prettytable (from ipython-sql)
  Downloading prettytable-3.12.0-py3-none-any.whl.metadata (30 kB)
Requirement already satisfied: ipython in /home/encore/miniconda3/lib/python3.10/site-packages (from ipython-sql) (8.29.0)
Requirement already satisfied: sqlalchemy>=2.0 in /home/encore/miniconda3/lib/python3.10/site-packages (from ipython-sql) (2.0.36)
Collecting sqlparse (from ipython-sql)
  Using cached sqlparse-0.5.2-py3-none-any.whl.metadata (3.9 kB)
Requirement already satisfied: six in /home/encore/miniconda3/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Collecting ipython-genutils (from ipython-sql)
  Downloading ipython_genutils-0.2.0-py2.py3-none-any.whl.metadata (755 bytes)
Requirement already satisfied: typing-extensions>=4.6.0 in /home/encore/miniconda3/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /home/encore/miniconda3/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: decorator in /home/encore/miniconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /home/encore/miniconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in /home/encore/miniconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in /home/encore/miniconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.48)
Requirement already satisfied: pygments>=2.4.0 in /home/encore/miniconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: stack-data in /home/encore/miniconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in /home/encore/miniconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: exceptiongroup in /home/encore/miniconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (1.2.2)
Requirement already satisfied: pexpect>4.3 in /home/encore/miniconda3/lib/python3.10/site-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /home/encore/miniconda3/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /home/encore/miniconda3/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /home/encore/miniconda3/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing>=1.2.0 in /home/encore/miniconda3/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.1.0)
Requirement already satisfied: asttokens>=2.1.0 in /home/encore/miniconda3/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in /home/encore/miniconda3/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.3)
Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Downloading ipython_genutils-0.2.0-py2.py3-none-any.whl (26 kB)
Downloading prettytable-3.12.0-py3-none-any.whl (31 kB)
Using cached sqlparse-0.5.2-py3-none-any.whl (44 kB)
Installing collected packages: ipython-genutils, sqlparse, prettytable, ipython-sql
Successfully installed ipython-genutils-0.2.0 ipython-sql-0.5.0 prettytable-3.12.0 sqlparse-0.5.2
Note: you may need to restart the kernel to use updated packages.

In [2]:
#%는 매직명령어
%load_ext sql
%config SqlMagic.autocommit=False

In [3]:
import pandas as pd

In [5]:
hflight = pd.read_csv("./hflight.csv")

In [6]:
hflight.head(3)

,Year,Month,DayofMonth,DayOfWeek,DepTime,ArrTime,UniqueCarrier,FlightNum,TailNum,ActualElapsedTime,...,ArrDelay,DepDelay,Origin,Dest,Distance,TaxiIn,TaxiOut,Cancelled,CancellationCode,Diverted
0,2011,1,1,6,1400.0,1500.0,AA,428,N576AA,60.0,...,-10.0,0.0,IAH,DFW,224,7.0,13.0,0,NaN,0
1,2011,1,2,7,1401.0,1501.0,AA,428,N557AA,60.0,...,-9.0,1.0,IAH,DFW,224,6.0,9.0,0,NaN,0
2,2011,1,3,1,1352.0,1502.0,AA,428,N541AA,70.0,...,-8.0,-8.0,IAH,DFW,224,5.0,17.0,0,NaN,0

In [8]:
import sqlalchemy 
from urllib import parse

user = 'encore'
password = '1234'
host='127.0.0.1'
port = 3306
database = 'encore'
password = parse.quote_plus(password)
engine = sqlalchemy.create_engine(f"mysql://{user}:{password}@{host}:{port}/{database}")

try:
    with engine.connect() as connection:
        print("Database connection successful!")
except Exception as e:
    print(f"Database connection failed: {e}")

Database connection successful!

In [9]:
hflight.to_sql("flight", if_exists='replace', con=engine)

227496

### 주피터상에서 SQL문 사용

In [29]:
%load_ext sql
%config SqlMagic.autocommit=False 
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [30]:
%sql mysql://encore:1234@127.0.0.1:3306/encore

In [78]:
%sql SELECT Origin, Dest, round(avg(DepDelay),2) DepDelay, round(avg(ArrDelay),2) ArrDelay\
FROM flight \
GROUP BY Origin, Dest limit 5;

#Select * from flight limit 5;

 * mysql://encore:***@127.0.0.1:3306/encore
5 rows affected.

[('IAH', 'DFW', 8.76, 5.51),
 ('IAH', 'MIA', 4.86, 0.65),
 ('IAH', 'SEA', 9.8, 9.65),
 ('HOU', 'JFK', 13.32, 9.86),
 ('IAH', 'HNL', 15.94, 10.93)]

### 출발 공항에 대해 도착 공항별로 평균 출발 지연시간, 평균 도착 지연시간을 구해 DataFrame 생성

In [76]:
#Origin 출발공항, Dest 도착공항, DepDealy 출발 지연시간, ArrDelay 도착 지연시간, mean() 평균
#hflight.groupby(['Origin', 'Dest'])[['DepDelay', 'ArrDelay']].mean()
hflight.groupby(['Origin', 'Dest'], as_index = False)[['DepDelay', 'ArrDelay']].mean()
#hflight.groupby(['Origin', 'Dest'])[['DepDelay', 'ArrDelay']].mean().reset_index()

    Origin Dest   DepDelay   ArrDelay
0      HOU  ABQ  11.581854   6.000987
1      HOU  ATL   9.129112   6.810014
2      HOU  AUS  12.188736   9.274145
3      HOU  BHM  15.014599   6.672540
4      HOU  BKG  -3.201835 -16.233645
..     ...  ...        ...        ...
144    IAH  TUL   5.738174   5.482379
145    IAH  TUS   7.783871   7.801680
146    IAH  TYS  10.170549  11.365915
147    IAH  VPS  12.338691  12.457176
148    IAH  XNA   6.690685   6.896277

[149 rows x 4 columns]

### 목적지 공항(Dest)에 대해 연착 건수를 구하고 2000회 이상인 공항만 추출
### ArrDelay 값이 5분 이상이면 연착 건수

In [12]:
mask = hflight['ArrDelay'] >= 5

In [15]:
hflight.isnull().sum()

Year                      0
Month                     0
DayofMonth                0
DayOfWeek                 0
DepTime                2905
ArrTime                3066
UniqueCarrier             0
FlightNum                 0
TailNum                 795
ActualElapsedTime      3622
AirTime                3622
ArrDelay               3622
DepDelay               2905
Origin                    0
Dest                      0
Distance                  0
TaxiIn                 3066
TaxiOut                2947
Cancelled                 0
CancellationCode     224523
Diverted                  0
dtype: int64

In [18]:
#결측치가 없는 속성값으로 count해줘야 함
tmp1 = hflight.loc[mask, :].groupby(['Dest'])['Year'].count()

In [19]:
mask2 = tmp1 >= 2000

In [20]:
tmp1[mask2]

Dest
ATL    2657
DAL    3360
DEN    2315
LAX    2641
MSY    2361
ORD    2220
Name: Year, dtype: int64

In [26]:
hflight2 = hflight[hflight.Dest.isin(tmp1[mask2].index)].copy()

In [27]:
hflight2

,Year,Month,DayofMonth,DayOfWeek,DepTime,ArrTime,UniqueCarrier,FlightNum,TailNum,ActualElapsedTime,...,ArrDelay,DepDelay,Origin,Dest,Distance,TaxiIn,TaxiOut,Cancelled,CancellationCode,Diverted
356,2011,1,31,1,1825.0,1925.0,CO,5,N17245,60.0,...,-9.0,0.0,IAH,MSY,305,3.0,15.0,0,NaN,0
358,2011,1,31,1,1522.0,1632.0,CO,33,N16647,70.0,...,-2.0,-3.0,IAH,MSY,305,7.0,21.0,0,NaN,0
360,2011,1,31,1,1916.0,2103.0,CO,47,N76522,227.0,...,2.0,6.0,IAH,LAX,1379,8.0,20.0,0,NaN,0
361,2011,1,31,1,747.0,936.0,CO,52,N67134,229.0,...,5.0,2.0,IAH,LAX,1379,11.0,17.0,0,NaN,0
362,2011,1,31,1,1803.0,1927.0,CO,59,N57870,144.0,...,15.0,28.0,IAH,DEN,862,12.0,16.0,0,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
227463,2011,12,6,2,1533.0,1635.0,WN,1224,N285WN,62.0,...,5.0,3.0,HOU,MSY,302,5.0,9.0,0,NaN,0
227464,2011,12,6,2,925.0,1029.0,WN,1254,N617SW,64.0,...,4.0,0.0,HOU,MSY,302,4.0,10.0,0,NaN,0
227465,2011,12,6,2,1648.0,1751.0,WN,1300,N744SW,63.0,...,11.0,13.0,HOU,MSY,302,4.0,11.0,0,NaN,0
227466,2011,12,6,2,752.0,857.0,WN,1628,N435WN,65.0,...,2.0,-3.0,HOU,MSY,302,4.0,11.0,0,NaN,0
227467,2011,12,6,2,651.0,746.0,WN,2534,N232WN,55.0,...,-9.0,-4.0,HOU,MSY,302,5.0,7.0,0,NaN,0

In [51]:
#view 생성
%sql create view flight2 as \
    select * from flight where Dest in \
    (select Dest from (SELECT Dest, count(Year) as cnt FROM flight \
        WHERE ArrDelay >= 5 \
        GROUP BY Dest \
        HAVING cnt > 2000) a);

 * mysql://encore:***@127.0.0.1:3306/encore
0 rows affected.

[]

In [53]:
%sql select * from flight2 limit 5;

 * mysql://encore:***@127.0.0.1:3306/encore
5 rows affected.

[(356, 2011, 1, 31, 1, 1825.0, 1925.0, 'CO', 5, 'N17245', 60.0, 42.0, -9.0, 0.0, 'IAH', 'MSY', 305, 3.0, 15.0, 0, None, 0),
 (358, 2011, 1, 31, 1, 1522.0, 1632.0, 'CO', 33, 'N16647', 70.0, 42.0, -2.0, -3.0, 'IAH', 'MSY', 305, 7.0, 21.0, 0, None, 0),
 (360, 2011, 1, 31, 1, 1916.0, 2103.0, 'CO', 47, 'N76522', 227.0, 199.0, 2.0, 6.0, 'IAH', 'LAX', 1379, 8.0, 20.0, 0, None, 0),
 (361, 2011, 1, 31, 1, 747.0, 936.0, 'CO', 52, 'N67134', 229.0, 201.0, 5.0, 2.0, 'IAH', 'LAX', 1379, 11.0, 17.0, 0, None, 0),
 (362, 2011, 1, 31, 1, 1803.0, 1927.0, 'CO', 59, 'N57870', 144.0, 116.0, 15.0, 28.0, 'IAH', 'DEN', 862, 12.0, 16.0, 0, None, 0)]

### 위의 결과를 바탕으로 목적지 공항 별 결항 횟수, 회항 횟수, 운항 횟수를 구하기 
### 운항 횟수 = 결항과 회항을 제외한 것 
### Cancelled, Diverted, Air

In [54]:
hflight2.groupby(['Dest'])[['Year']].count()

      Year
Dest
ATL   7886
DAL   9820
DEN   5920
LAX   6064
MSY   6823
ORD   5748

In [58]:
#1데이터만 합계
hflight2.groupby(['Dest'])[['Cancelled']].sum()

      Cancelled
Dest
ATL         141
DAL         442
DEN          28
LAX          33
MSY          40
ORD          99

In [59]:
hflight2.groupby(['Dest'])[['Diverted']].sum()

      Diverted
Dest
ATL         28
DAL         27
DEN         24
LAX         14
MSY          3
ORD         15

In [63]:
tmp3 = pd.concat([hflight2.groupby(['Dest'])[['Year']].count(), 
           hflight2.groupby(['Dest'])[['Cancelled']].sum(),
           hflight2.groupby(['Dest'])[['Diverted']].sum()], axis=1)

In [64]:
tmp3

      Year  Cancelled  Diverted
Dest
ATL   7886        141        28
DAL   9820        442        27
DEN   5920         28        24
LAX   6064         33        14
MSY   6823         40         3
ORD   5748         99        15

In [66]:
tmp3['air'] = tmp3.apply(lambda x : x[0] - x[1] - x[2] , axis=1)

/tmp/ipykernel_10712/1221428539.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  tmp3['air'] = tmp3.apply(lambda x : x[0] - x[1] - x[2] , axis=1)

In [67]:
tmp3

      Year  Cancelled  Diverted   air
Dest
ATL   7886        141        28  7717
DAL   9820        442        27  9351
DEN   5920         28        24  5868
LAX   6064         33        14  6017
MSY   6823         40         3  6780
ORD   5748         99        15  5634

In [69]:
tmp3.drop(['Year'], axis=1, inplace=True)

In [70]:
tmp3

      Cancelled  Diverted   air
Dest
ATL         141        28  7717
DAL         442        27  9351
DEN          28        24  5868
LAX          33        14  6017
MSY          40         3  6780
ORD          99        15  5634

In [73]:
tmp3 = tmp3[['air', 'Diverted','Cancelled']]

In [74]:
tmp3

       air  Diverted  Cancelled
Dest
ATL   7717        28        141
DAL   9351        27        442
DEN   5868        24         28
LAX   6017        14         33
MSY   6780         3         40
ORD   5634        15         99